-- ЗАДАЧА 3: Распределение объема выручки по дням недели И водителям
-- День недели: 1 (понедельник) ... 7 (воскресенье)
SELECT
    CAST(EXTRACT(ISODOW FROM ПОЕЗДКИ.дата) AS INTEGER) AS "День недели",
    ВОДИТЕЛИ.фамилия || ' ' || SUBSTRING(ВОДИТЕЛИ.имя, 1, 1) || '.' AS "Водитель",
    SUM(ПОЕЗДКИ.стоимость) AS "Выручка"
FROM ПОЕЗДКИ
INNER JOIN ВОДИТЕЛИ ON ВОДИТЕЛИ.код = ПОЕЗДКИ.водитель
GROUP BY "День недели", ВОДИТЕЛИ.код, ВОДИТЕЛИ.фамилия, ВОДИТЕЛИ.имя
ORDER BY "День недели", "Выручка" DESC;
